#ifndef _KEY_CTRL_LED_H_
#define _KEY_CTRL_LED_H_

#include "sys_inc.h"

#define LED_INDEX_NUM 10    //led灯的总数量

//对应WS300_D_V1.0板led灯序号
enum led_index_e {
    led1_red,       //开机灯
    led1_blue,
    led2_red,       //g24连接灯
    led2_blue,
    led3_red,
    led3_blue,
    led4_green,     //降噪使能灯
    led4_blue,
    led5_red,
    led5_blue,
};

//将led的gpio设为disable
/*------------------------------------------------------------------------------
* 函数功能: led的gpio设为disable
* 函数名称: void key_led_disable_gpio()
* 参    数: 无
* 返 回 值: 无
* 说明 :无
*-------------------------------------------------------------------------------*/
void key_led_disable_gpio();

/*------------------------------------------------------------------------------
* 函数功能: 设置g24连接状态
* 函数名称: void key_led_set_g24_connect_status(uint8_t link, int8_t light)
* 参    数:
*          light:0：断开连接或未连接、1：已连接
* 返 回 值: 无
* 说明 :无
*-------------------------------------------------------------------------------*/
void key_led_set_g24_connect_status(uint8_t link, int8_t light);

/*------------------------------------------------------------------------------
* 函数功能: 获取g24连接状态
* 函数名称: int8_t key_led_get_g24_connect_status(uint8_t link)
* 参    数: 无
* 返 回 值: g24状态
*           1：g24已连接
*           0：断开连接或未连接
* 说明 :无
*-------------------------------------------------------------------------------*/
int8_t key_led_get_g24_connect_status(uint8_t link);

/*------------------------------------------------------------------------------
* 函数功能: 获取g24灯状态
* 函数名称: void key_led_set_g24_light_status(uint8_t link, bool light)
* 参    数: 
*           light：true：亮、false：熄灭
* 返 回 值: 无
* 说明 :无
*-------------------------------------------------------------------------------*/
void key_led_set_g24_light_status(uint8_t link, bool light);

/*------------------------------------------------------------------------------
* 函数功能: 点亮led灯
* 函数名称: void key_led_on()
* 参    数: 无
* 返 回 值: 无
* 说明 :点亮led灯
*-------------------------------------------------------------------------------*/
void key_led_on();

/*------------------------------------------------------------------------------
* 函数功能: 设置led灯状态
* 函数名称: void key_led_set_status(uint8_t led_index, bool light)
* 参    数: 
*           led_index：需要设置的led灯序号
*               light：设置  灯的状态(true：点亮、false：熄灭)
* 返 回 值: 无
* 说明 :设置除开机灯和g24连接灯之外的led灯
*-------------------------------------------------------------------------------*/
void key_led_set_status(uint8_t led_index, bool light);

/*------------------------------------------------------------------------------
* 函数功能: 设置充电灯状态
* 函数名称: void key_led_set_charge_status(int8_t light)
* 参    数:
*          light:0：充电关、1：正在充电
* 返 回 值: 无
* 说明 :无
*-------------------------------------------------------------------------------*/
void key_led_set_charge_status(bool light);

/*------------------------------------------------------------------------------
* 函数功能: key led定时器处理
* 函数名称: void key_led_timer_proc(void)
* 参    数: 无
* 返 回 值: 无
* 说明 :无
*-------------------------------------------------------------------------------*/
void key_led_timer_proc(void);

#endif
