#ifndef _HAL_AUDIO_HEAP_H_
#define _HAL_AUDIO_HEAP_H_

#include "sys_inc.h"

#ifdef __cplusplus
extern "C" {
#endif


enum audio_malloc_msg_t {
    AUDIO_MALLOC_MSG_NONE,
    AUDIO_MALLOC_MSG_FAIL,
};

typedef struct {
    void *dec_buf;            //算法内存
    uint32_t dec_buf_size;    //算法内存大小
    void *engine_buf;         //硬件加速器内存
    uint32_t engine_buf_size; //硬件加速器内存大小
} audio_heap_init_t;

/*------------------------------------------------------------------------------
* 函数功能: audio内存管理初始化
* 函数名称: void audio_heap_init(audio_heap_init_t *init);
* 参    数:
*           init: 初始化参数
* 返 回 值: 无
* 说明 :
*-------------------------------------------------------------------------------*/
void audio_heap_init(audio_heap_init_t *init);

/*------------------------------------------------------------------------------
* 函数功能: 硬件加速器内存分配
* 函数名称: void* audio_engine_malloc(uint32_t size); void* audio_engine_calloc(uint32_t size)
* 参    数:
*           size: 需要分配的内存大小(bytes)
* 返 回 值: 成功返回分配到的内存地址，失败返回NULL
* 说明 :仅硬件加速器使用此函数
*-------------------------------------------------------------------------------*/
void* audio_engine_malloc(uint32_t size);
void* audio_engine_calloc(uint32_t size);

/*------------------------------------------------------------------------------
* 函数功能: 硬件加速器内存释放
* 函数名称: void audio_engine_free(void *ptr)
* 参    数:
*           ptr: 需要释放的内存
* 返 回 值: 无
* 说明 :仅硬件加速器使用此函数
*-------------------------------------------------------------------------------*/
void audio_engine_free(void *ptr);

/*------------------------------------------------------------------------------
* 函数功能: 硬件加速器当前空闲内存大小
* 函数名称: uint32_t audio_engine_get_avaheapsize(void)
* 参    数: 无
* 返 回 值: 返回当前空闲内存大小(bytes)
* 说明 :仅硬件加速器使用此函数
*-------------------------------------------------------------------------------*/
uint32_t audio_engine_get_avaheapsize(void);

/*------------------------------------------------------------------------------
* 函数功能: 硬件加速器当前最大空闲内存块大小
* 函数名称: uint32_t audio_engine_get_maxblocksize(void)
* 参    数: 无
* 返 回 值: 返回当前最大空闲内存块大小(bytes)
* 说明 :仅硬件加速器使用此函数，当前最大空闲内存块大小一定小于等于当前空闲内存大小
*-------------------------------------------------------------------------------*/
uint32_t audio_engine_get_maxblocksize(void);

/*------------------------------------------------------------------------------
* 函数功能: 硬件加速器当前已分配内存大小
* 函数名称: uint32_t audio_engine_get_heapmallocsize(void)
* 参    数: 无
* 返 回 值: 返回当前已分配内存大小(bytes)
* 说明 :仅硬件加速器使用此函数
*-------------------------------------------------------------------------------*/
uint32_t audio_engine_get_heapmallocsize(void);

/*------------------------------------------------------------------------------
* 函数功能: 算法分配内存函数
* 函数名称: void *general_malloc(uint32_t size); void *general_calloc(uint32_t size)
* 参    数:
*           size: 需要分配的内存大小(bytes)
* 返 回 值: 成功返回分配到的内存地址，失败返回NULL
* 说明 :仅算法和音频中间件使用此函数
*-------------------------------------------------------------------------------*/
void *general_malloc(uint32_t size);
void *general_calloc(uint32_t size);

/*------------------------------------------------------------------------------
* 函数功能: 算法内存释放
* 函数名称: void general_free(void *ptr)
* 参    数:
*           ptr: 需要释放的内存
* 返 回 值: 无
* 说明 :仅算法和音频中间件使用此函数
*-------------------------------------------------------------------------------*/
void general_free(void *ptr);

/*------------------------------------------------------------------------------
* 函数功能: 算法当前空闲内存大小
* 函数名称: uint32_t general_get_avaheapsize(void)
* 参    数: 无
* 返 回 值: 返回当前空闲内存大小(bytes)
* 说明 :仅算法和音频中间件使用此函数
*-------------------------------------------------------------------------------*/
uint32_t general_get_avaheapsize(void);

/*------------------------------------------------------------------------------
* 函数功能: 算法当前最大空闲内存块大小
* 函数名称: uint32_t general_get_maxblocksize(void)
* 参    数: 无
* 返 回 值: 返回当前最大空闲内存块大小(bytes)
* 说明 :仅算法和音频中间件使用此函数，当前最大空闲内存块大小一定小于等于当前空闲内存大小
*-------------------------------------------------------------------------------*/
uint32_t general_get_maxblocksize(void);

/*------------------------------------------------------------------------------
* 函数功能: 算法当前已分配内存大小
* 函数名称: uint32_t general_get_heapmallocsize(void)
* 参    数: 无
* 返 回 值: 返回当前已分配内存大小(bytes)
* 说明 :仅算法和音频中间件使用此函数
*-------------------------------------------------------------------------------*/
uint32_t general_get_heapmallocsize(void);


/*------------------------------------------------------------------------------
* 函数功能: 算法内存分配消息函数注册
* 函数名称: void audio_malloc_msg_callback_register(void(*audio_malloc_msg_cb)(uint32_t cmd, uint32_t param));
* 参    数: 
             cmd: 见enum audio_malloc_msg_t
             param：命令携带的参数
* 返 回 值: NULL
*-------------------------------------------------------------------------------*/
void audio_malloc_msg_callback_register(void(*audio_malloc_msg_cb)(uint32_t cmd, uint32_t param));

#ifdef __cplusplus
}
#endif

#endif /* _HAL_AUDIO_HEAP_H_ */
